[
  {
    "course": "IT & CS at Aarhus University",
    "url": "https://cs.au.dk/education/"
  },
  {
    "course": "Physical Computing",
    "level": "Bachelor",
    "description": "The purpose of the course is to provide the basic understanding of the Physical Computing paradigm, how different forms of energy (e.g. speed, sound, kinetic, force) can be used as input and output in Human-Computer Interaction (HCI) scenarios. The course will cover the fundamental concepts of the Physical Computing paradigm. Students on this course will study the properties and use of standard components such as resistors, diodes, transistors and capacitors but also more complex components such as microcontrollers, sensors, and actuators. They will learn how to apply these components to create standalone interactive circuits that can be integrated into everyday objects, with a didactic focus on physical properties and interaction models. Following on from this, students will learn how to create and print 3D models, and explore the haptic properties of different materials. This will provide the students with the skills for prototyping and building mock-ups of new interactive artefacts and environments. The student should understand how hardware, software and other materials can be combined in the design of computational objects for HCI.",
    "qualifications": [
      "use basic electronic components and sensors / actuators to design and construct interactive artifacts and/or environments from scratch",
      "construct more advanced interactive devices or systems based on standalone microcontrollers",
      "utilize 3D printers to print CAD models",
      "integrate electronic circuits with 3D prints",
      "prototype a working Physical Computing system according to a project brief provided during class",
      "evaluate and reflect on the work done in class from a technological, user experience and multimodal interaction perspective",
      "support prototype design choices with scientifically grounded arguments, referencing related work in HCI, Psychology, and Physical Computing"
    ],
    "url": "https://kursuskatalog.au.dk/en/course/82735/Physical-Computing"
  },
  {
    "course": "Multimodal Interaction",
    "level": "Master",
    "description": "The course will focus on the main theoretical and practical aspects of multimodal interaction. The course will cover visual, auditory, haptic, and olfactory perception, models of multimodal interaction, psychophysical evaluation methods, and the development of multisensory prototypes.",
    "qualifications": [
      "define the basics of human visual, auditory and tactile perception",
      "describe the functionality of state-of-the-art multimodal HCI interfaces",
      "prototype multimodal interfaces",
      "apply psychophysical methods to evaluate human performance with multimodal interfaces",
      "discuss the strengths and weaknesses of multimodal interfaces",
      "generalize and transfer principles of multimodal interaction to new interfaces and environments."
    ],
    "url": "https://kursuskatalog.au.dk/en/course/82742/Multimodal-Interaction"
  }
]
